*** ext
each webprocess starts a dbus eval server
#+begin_example
busctl --user 2>/dev/null | grep code.girlib.wkmkclext | read busname pid name user dest unit session description ; echo  busctl --user introspect $busname  "/code/wkmkclext/$pid" code.girlib.EvalServer
#+end_example
we can use emacs to talk to it via org-babel
#+begin_src elisp :no-eval t
;; dbus-send --session --dest=org.freedesktop.DBus --type=method_call --print-reply /org/freedesktop/DBus org.freedesktop.DBus.ListNames | grep code.girlib.wkmkclext
;; busctl --user 2>/dev/null | grep code.girlib.wkmkclext

(setq $exts
      (cl-remove-if-not (lambda (s) (cl-search "code.girlib.wkmkclext.id" s))
			(dbus-call-method :session
					  "org.freedesktop.DBus"
					  "/org/freedesktop/DBus"
					  "org.freedesktop.DBus"
					  "ListNames")))
(setq $ext (car $exts))

(defun extract-pid (string)
  (and (string-match "code.girlib.wkmkclext.id\\([0-9]+\\)" string)
       (match-string 1 string)))

(cl-defun eval-in-wyeb-ext (string &optional (dest $ext))
  (interactive "sEval in Wyeb Ext: ")
  (let* ((pid (extract-pid dest))
	 (ret
	  (dbus-call-method :session dest
			    (format "/code/wkmkclext/%s" pid)
			    "code.girlib.EvalServer"
			    "Eval"
			    string)))
    (if (called-interactively-p t)
	(message "%s" ret)
      ret)))

;; (eval-in-wyeb-ext "(+ 1 2)" $ext)
;; (eval-in-wyeb-ext "(progn (load \"~/sly-config.lisp\")(cl-user::slynk-start))")

;; define a babel language `wyeb-ext' that executes a code block in
;; the default browser extension via dbus

(defvar org-babel-default-header-args:wyeb-ext '())
(defvar org-babel-header-args:wyeb-ext '())
					;(package . any)
(defun org-babel-execute:wyeb-ext (body params)
  "BODY is lisp code which is sent to the extension."
  (let* ((result-params (cdr (assq :result-params params)))
	 ;; Fixme - eval-in-wyeb-ext returns 4 values
	 (result (pp (eval-in-wyeb-ext body $ext))))
    (org-babel-result-cond result-params
	(let ((print-level nil)
              (print-length nil))
          (if (or (member "scalar" result-params)
                  (member "verbatim" result-params))
              (format "%S" result)
            (format "%s" result)))
	(org-babel-reassemble-table
	 result
         (org-babel-pick-name (cdr (assq :colname-names params))
                              (cdr (assq :colnames params)))
         (org-babel-pick-name (cdr (assq :rowname-names params))
                              (cdr (assq :rownames params)))))))
#+end_src

now that we've defined the language

#+begin_src wyeb-ext
(+ 1 2)
#+end_src

#+RESULTS:
: (t "3" "" "")

*** getting the dom
#+begin_src wyeb-ext
(+ 2 3)
#+end_src

#+RESULTS:
: (t "5" "" "")
